app/controllers/movies_controller.rb

    def index
      @movies = Movie.all
      # initialize all_ratings and handle nil cases for the ratings
      @all_ratings = Movie.all_ratings

      # set up array if check boxes are checked
      if params.has_key?(:ratings)
        # grab the keys of the hash using .keys
        # set to @ratings_to_show (from index.html.erb)
        @ratings_to_show = params[:ratings].keys
      # empty array if no check boxes are checked
      else
        @ratings_to_show = []
      end

      # replace Movie.all (restrict DB query)
      @movies = Movie.with_ratings(@ratings_to_show)

      # create hashed ratings for view
      @hashed_ratings = Hash[@ratings_to_show.map {|key| [key, 1]}]

      # initialize to prevent errors
      @title_header_css, @release_date_header_css = "", ""
      if (params.has_key?(:sort_column))
        if params[:sort_column] == "title"
          # order by the sort_column
          @movies = @movies.order("title")
---
SELECT "movies".* FROM "movies"  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG', 'PG-13')  ORDER BY release_date